AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_mraminfo0.h
// SECURITY_WIRED_IFC_CFG3 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 1.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PINCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PINCFG_M 0xFFFFFFFF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PINCFG(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PINCFG_Pos 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PINCFG_Msk 0xFFFFFFFF

// SECURITY_WIRED_IFC_CFG4 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 2.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PINCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PINCFG_M 0xFFFFFFFF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PINCFG(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PINCFG_Pos 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PINCFG_Msk 0xFFFFFFFF

// SECURITY_WIRED_IFC_CFG5 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 3.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PINCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PINCFG_M 0xFFFFFFFF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PINCFG(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PINCFG_Pos 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PINCFG_Msk 0xFFFFFFFF

// SECURITY_VERSION - This 32-bit word contains the version ID used for revision control
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_S 0
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_M 0xFFFFFFFF
#define AM_REG_INFO0_SECURITY_VERSION_VERSION(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_Pos 0
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_Msk 0xFFFFFFFF

// SECURITY_SRAM_RESV - This 32-bit word indicates the minimum amount of DTCM that the Secure Boot Loader (SBL) reserves for the application, which will not be disturbed by SBL across a reset. The programmed value is rounded up, if necessary, by SBL to the next 256 byte boundary. That value is subtracted from the top of DTCM, resulting in a region at the top of DTCM that becomes the reserved area. Example: Apollo5 has 384KB of DTCM, 0x20000000-0x20005FFF. SRAM_RESV contains 0x3E8, SBL rounds up to 0x400, and reserves the region 0x20005C00 - 0x20005FFF for use by the application. Application data in this region will not be modified by SBL across reset.
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_S 0
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_M 0x000FFFFF
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_Pos 0
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_Msk 0x000FFFFF

// SECURITY_RMAOVERRIDE - Enables Ambiq to have the ability to download Ambiq RMA.
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_RSVD_ZERO_S 3
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_RSVD_ZERO_M 0xFFFFFFF8
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_RSVD_ZERO(n) (((uint32_t)(n) << 3) & 0xFFFFFFF8)
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_RSVD_ZERO_Pos 3
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_RSVD_ZERO_Msk 0xFFFFFFF8
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_OVERRIDE_S 0
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_OVERRIDE_M 0x00000007
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_OVERRIDE(n) (((uint32_t)(n) << 0) & 0x00000007)
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_OVERRIDE_Pos 0
#define AM_REG_INFO0_SECURITY_RMAOVERRIDE_OVERRIDE_Msk 0x00000007
#define AM_ENUM_INFO0_SECURITY_RMAOVERRIDE_OVERRIDE_ENABLE      0x2  // Enables override.

// WIRED_TIMEOUT - Holds the timeout value for wired transfers (in milliseconds).
#define AM_REG_INFO0_WIRED_TIMEOUT_TIMEOUT_S 0
#define AM_REG_INFO0_WIRED_TIMEOUT_TIMEOUT_M 0x0000FFFF
#define AM_REG_INFO0_WIRED_TIMEOUT_TIMEOUT(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_INFO0_WIRED_TIMEOUT_TIMEOUT_Pos 0
#define AM_REG_INFO0_WIRED_TIMEOUT_TIMEOUT_Msk 0x0000FFFF

// SBR_SDCERT_ADDR - Location where bootloader will find SD certificates. Customer configures this based on the memory layout.
#define AM_REG_INFO0_SBR_SDCERT_ADDR_ICV_S 0
#define AM_REG_INFO0_SBR_SDCERT_ADDR_ICV_M 0xFFFFFFFF
#define AM_REG_INFO0_SBR_SDCERT_ADDR_ICV(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_SBR_SDCERT_ADDR_ICV_Pos 0
#define AM_REG_INFO0_SBR_SDCERT_ADDR_ICV_Msk 0xFFFFFFFF

// MAINPTR - Pointer to the main OEM image when Secure Boot is disabled.
#define AM_REG_INFO0_MAINPTR_ADDRESS_S 0
#define AM_REG_INFO0_MAINPTR_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO0_MAINPTR_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_MAINPTR_ADDRESS_Pos 0
#define AM_REG_INFO0_MAINPTR_ADDRESS_Msk 0xFFFFFFFF

// CERTCHAINPTR - Pointer to OEM certificate chain when Secure Boot is enabled.
#define AM_REG_INFO0_CERTCHAINPTR_ADDRESS_S 0
#define AM_REG_INFO0_CERTCHAINPTR_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO0_CERTCHAINPTR_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_CERTCHAINPTR_ADDRESS_Pos 0
#define AM_REG_INFO0_CERTCHAINPTR_ADDRESS_Msk 0xFFFFFFFF

// MRAM_RCVY_CTRL - MRAM recovery master enable and enables for recovery types and GPIO pins for status and initiation.
#define AM_REG_INFO0_MRAM_RCVY_CTRL_MRAM_RCVY_EN_S 28
#define AM_REG_INFO0_MRAM_RCVY_CTRL_MRAM_RCVY_EN_M 0xF0000000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_MRAM_RCVY_EN(n) (((uint32_t)(n) << 28) & 0xF0000000)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_MRAM_RCVY_EN_Pos 28
#define AM_REG_INFO0_MRAM_RCVY_CTRL_MRAM_RCVY_EN_Msk 0xF0000000
#define AM_ENUM_INFO0_MRAM_RCVY_CTRL_MRAM_RCVY_EN_M_ENABLE      0x6  // Enables override, other vales = disabled.
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_RCVY_INPROGRESS_S 20
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_RCVY_INPROGRESS_M 0x0FF00000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_RCVY_INPROGRESS(n) (((uint32_t)(n) << 20) & 0x0FF00000)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_RCVY_INPROGRESS_Pos 20
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_RCVY_INPROGRESS_Msk 0x0FF00000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION_S 18
#define AM_REG_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION_M 0x000C0000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION(n) (((uint32_t)(n) << 18) & 0x000C0000)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION_Pos 18
#define AM_REG_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION_Msk 0x000C0000
#define AM_ENUM_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION_USER        0x0  // Specifies the eMMC USER partition.
#define AM_ENUM_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION_BOOT1       0x1  // Specifies the eMMC BOOT1 partition.
#define AM_ENUM_INFO0_MRAM_RCVY_CTRL_EMMC_PARTITION_BOOT2       0x2  // Specifies the eMMC BOOT2 partition.
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WD_EN_S 17
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WD_EN_M 0x00020000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WD_EN(n) (((uint32_t)(n) << 17) & 0x00020000)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WD_EN_Pos 17
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WD_EN_Msk 0x00020000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_POL_S 16
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_POL_M 0x00010000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_POL(n) (((uint32_t)(n) << 16) & 0x00010000)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_POL_Pos 16
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_POL_Msk 0x00010000
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_PIN_S 8
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_PIN_M 0x0000FF00
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_PIN(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_PIN_Pos 8
#define AM_REG_INFO0_MRAM_RCVY_CTRL_GPIO_CTRL_PIN_Msk 0x0000FF00
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_REBOOT_S 7
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_REBOOT_M 0x00000080
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_REBOOT(n) (((uint32_t)(n) << 7) & 0x00000080)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_REBOOT_Pos 7
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_REBOOT_Msk 0x00000080
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE_S 4
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE_M 0x00000070
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE(n) (((uint32_t)(n) << 4) & 0x00000070)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE_Pos 4
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE_Msk 0x00000070
#define AM_ENUM_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE_NV_OFF        0x0  // Non-volatile MRAM recovery disabled
#define AM_ENUM_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE_NV_MSPI       0x1  // MRAM Recovery using off-board MSPI device
#define AM_ENUM_INFO0_MRAM_RCVY_CTRL_NV_RCVY_TYPE_NV_EMMC       0x2  // MRAM Recovery using off-board EMMC device
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_MODULE_NUM_S 2
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_MODULE_NUM_M 0x0000000C
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_MODULE_NUM(n) (((uint32_t)(n) << 2) & 0x0000000C)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_MODULE_NUM_Pos 2
#define AM_REG_INFO0_MRAM_RCVY_CTRL_NV_MODULE_NUM_Msk 0x0000000C
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WIRED_RCVY_EN_S 1
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WIRED_RCVY_EN_M 0x00000002
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WIRED_RCVY_EN(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WIRED_RCVY_EN_Pos 1
#define AM_REG_INFO0_MRAM_RCVY_CTRL_WIRED_RCVY_EN_Msk 0x00000002
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_EN_S 0
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_EN_M 0x00000001
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_EN(n) (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_EN_Pos 0
#define AM_REG_INFO0_MRAM_RCVY_CTRL_APP_RCVY_EN_Msk 0x00000001

// NV_METADATA_OFFSET - Offset to the meta-data in the selected NV device. The meta-data supplies the offsets/sizes of the recovery images.  The Metadata is a 4 word "file" stored on the NV device, with the offset and size (in that order) for the SBL recovery image and OEMs recovery image (in that order). For EMMC devices the offset is a block offset, for MSPI it is a byte offset.
#define AM_REG_INFO0_NV_METADATA_OFFSET_META_OFFSET_S 0
#define AM_REG_INFO0_NV_METADATA_OFFSET_META_OFFSET_M 0xFFFFFFFF
#define AM_REG_INFO0_NV_METADATA_OFFSET_META_OFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_NV_METADATA_OFFSET_META_OFFSET_Pos 0
#define AM_REG_INFO0_NV_METADATA_OFFSET_META_OFFSET_Msk 0xFFFFFFFF

